// Задача 25: Напишите цикл, который принимает на вход два числа (A и B) и возводит число A в натуральную степень B.
// 3, 5 -> 243 (3⁵)
// 2, 4 -> 16

// int Degree(int numA, int numB)
// {
//     int result = 1;
//     for (int i = 1; i <= numB; i++)
//     {
//         result = result * numA;
//     }
//     return result;
// }

// Console.WriteLine("Введите первое число A");
// int A = Convert.ToInt32(Console.ReadLine());
// Console.WriteLine("Введите второе число B");
// int B = Convert.ToInt32(Console.ReadLine());

// int result = Degree(A, B);
// Console.WriteLine(result);


// Задача 27: Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе.
// 452 -> 11
// 82 -> 10
// 9012 -> 12

int Sum(int num)
{
    
    for(int i=0;i<=num;i++)
    {
        
    }

}

Console.WriteLine("Введите число");
int number = Convert.ToInt32(Console.ReadLine());

int result = Sum();
Console.WriteLine(result);

// Задача 29: Напишите программу, которая задаёт массив из 8 элементов и выводит их на экран.
// 1, 2, 5, 7, 19 -> [1, 2, 5, 7, 19]
// 6, 1, 33 -> [6, 1, 33]


